ahmedBetterDroplet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-1.3 -0.25 -0.0218)
    (3 -0.25 -0.0218)
    (3  0.25 -0.0218)
    (-1.3 0.25 -0.0218)
    (-1.3 -0.25 0.4782)
    (3 -0.25 0.4782)
    (3 0.25 0.4782)
    (-1.3 0.25 0.4782)

/*
    (-1.3 -0.87 -0.0218)
    (3 -0.87 -0.0218)
    (3  0.87 -0.0218)
    (-1.3 0.87 -0.0218)
    (-1.3 -0.87 1.7)
    (3 -0.87 1.7)
    (3 0.87 1.7)
    (-1.3 0.87 1.7)
*/
);

blocks
(
     hex (0 1 2 3 4 5 6 7) (146 17 17) simpleGrading (1 1 1)
	// hex (0 1 2 3 4 5 6 7) (204 24 24) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type wall; //patch
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type wall; //patch;
        faces
        (
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
